
#include <stdio.h>

void main()
{
	// 연산자 - 우선 순위, 결합 방향

	// 1
	// () - 함수 호출 ->
	// [] - 인덱스 ->
	// -> - 간접지정 ->
	// . - 직접지정 ->
	// ++(postfix), --(postfix) - 후위 증가 및 감소 ->

	// 2
	// ++(prefix), --(prefix) - 전위 증가 및 감소 <-
	// sizeof - 바이트 단위 크기 계산 <-
	// ~ - 비트 단위 NOT <-
	// ! - 논리 NOT
	// +, - - 부호연산(음수와 양수 표현) <-
	// & - 주소 연산 <-
	// * - 간접지정 연산 <-

	// 3
	// (casting) - 자료형 반환 <-

	// 4
	// *, /, % - 곱셈, 나눗셈 관련 연산 ->

	// 5
	// +, - - 덧셈, 뺄셈 ->

	// 6
	// <<, >>  - 비트 이동 ->

	// 7
	// <, >, <=, >= - 대소 비교 ->

	// 8
	// ==, != - 동등 비교 ->

	// 9
	// & - 비트 AND ->

	// 10
	// ^ - 비트 XOR ->

	// 11
	// | - 비트 OR ->

	// 12
	// && - 논리 AND ->

	// 13
	// || - 논리 OR ->

	// 14
	// ? : - 조건 연산 <-

	// 15
	// =, +=, -=, *=, /=, %=, <<=, >>=, &=, ^=, |= - 대입 연산 <-

	// 16
	// , - 콤마 연산 ->


}
